# Программа должна позволить пользователю
# ввести номер курса, а затем показать номер
# аудитории, имя преподавателя и время проведения курса.

def main():
    """Основная функция."""
    d1, d2, d3 = course()

    info = ''

    course_input = input('Номер курса: ')

    if course_input in d1:
        info += 'Аудитория №: ' + d1[course_input] + '\n'

    if course_input in d2:
        info += 'Ваш преподователь: ' + d2[course_input] + '\n'

    if course_input in d3:
        info += 'Начало в: ' + d3[course_input]

    print(info)

def course():
    """Информация по курсам."""

    # № Аудитории.
    dict1 = {
        'CS101': '3004', 'CS102': '4501', 'CS103': '6755',
        'CS104': '1244', 'CS105': '1411'
    }

    # Имя преподователя.
    dict2 = {
        'CS101': 'Хайнс', 'CS102': 'Альварадо',
        'CS103': 'Рич', 'NТ110': 'Берк',
        'CM241': 'Ли'
    }

    # Время начала курса.
    dict3 = {
        'CS101': '8:00', 'CS102': '9:00', 'CS103': '10:00',
        'NT110': '11:00', 'CM241': '13:00'
    }

    return dict1, dict2, dict3

main()