# Имитация игры в блек-джек.
# не доделано!!!
# Модуль для получения случайно карты игроком.
import random

def main():
    """Основная функция."""

    # Создаю колоду карт.
    deck = create_deck()    # 52 карты в колоде.
    player_one_two(deck)

def create_deck():
    # Создать словарь, в котором каждая карта и её значение
    # хранятся в виде пар ключ/значение.

    deck = {'Туз пик': 1, '2 пик': 2, '3 пик': 3,
            '4 пик': 4, '5 пик': 5, '6 пик': 6,
            '7 пик': 7, '8 пик': 8, '9 пик': 9,
            '10 пик': 10, 'Валет пик': 10,
            'Дама пик': 10, 'Король пик': 10,

            'Туз червей': 1, '2 червей': 2, '3 червей': 3,
            '4 червей': 4, '5 червей': 5, '6 червей': 6,
            '7 червей': 7, ' 8 червей': 8, '9 червей': 9,
            '10 червей': 10, 'Валет червей': 10,
            'Дама червей': 10, 'Король червей': 10,

            'Туз треф': 1, '2 треф ': 2, '3 треф': 3,
            '4 треф': 4, '5 треф': 5, '6 треф': 6,
            '7 треф': 7, '8 треф': 8, '9 треф': 9,
            '10 треф': 10, 'Валет треф': 10,
            'Дама треф ': 10, 'Король треф': 10,

            'Туз бубей': 1, '2 бубей': 2, '3 бубей': 3,
            '4 бубей': 4, '5 бубей': 5, '6 бубей': 6,
            '7 бубей': 7, '8 бубей': 8, '9 бубей': 9,
            '1О бубей': 10, 'Валет бубей': 10,
            'Дама бубей': 10, 'Король бубей': 10}

    return deck

def player_one_two(deck):
    """Получаю карты из колоды на 2х игроков."""

    # Сохраняю словарь.
    cards_deck = deck

    # Игрок №1:
    player_one = int(input('Кол-во карт для игрока №1: '))
    # Игрок №2:
    player_two = int(input('Кол-во карт для игрока №2: '))

    # Счетчики очков 1 и 2 игрока.
    count1 = 0
    count2 = 0

    if player_one + player_two > len(cards_deck):
        print('\nВ колоде всего', len(cards_deck), 'карты.')
        print('Начнем с начала...\n')
        main()
    else:
        for c in range(player_one):
            card = random.choice(list(cards_deck.keys()))
            count1 += cards_deck[card]
            del cards_deck[card]

        for c in range(player_two):
            card = random.choice(list(cards_deck.keys()))
            count2 += cards_deck[card]
            del cards_deck[card]

    print('Игрок №1 заработал', count1, 'очка(-ов).')
    print('Игрок №2 заработал', count2, 'очка(-ов).')

main()