# Напишите фрагмент кода, который создает множество
# с приведенными далее целыми
# числами в качестве его членов: 1О, 20, 30 и 40.

myset = set([10, 20, 30, 40])
print(myset)