# Эта программа демострирует метод split.

def main():
    # Создать строковое значение с несколькими словами.
    my_string = 'Один два три четыре'

    # Разбить строковое значение.
    word_list = my_string.split()

    # Напечатать список слов.
    print(word_list)
    
# Вызвать главную функцию.
main()