print("Один", end=" ")
print("Два", end=" ")
print("Три")

print("Один", 'Два', "Три", sep='-')
print("Один", "Два", "Три", sep="*")
print("Один", "Два", "Три", sep="~~~")

print("Один\nДва\nТри")

print("Пн\tВт\tСр")
print("Чт\tПт\tСб")

print("Домашнее задание на завтра - прочитать \"Гамлета\".")
print('Дочитать рассказ О\'Генри и возьмусь за домашку.')

print("Путь C:\\temp\\data.")

print("\nЭто " + 'один строковый литерал.')

print('Введите объем ' +
      'продаж за каждый день и ' +
      'нажмите Enter.')