# Эта программа выводит приведенные ниже
# числа с плавающей точкой в столбце,
# в котором десятичные знаки выровнены.
num1 = 127.899
num2 = 3465.148
num3 = 3.776
num4 = 264.821
num5 = 88.081
num6 = 799.999

# Вывести каждое число в поле шириной 7 пробелов
# с 2 десятичными знаками.
print(format(num1, '7.2f'))
print(format(num2, '7.2f'))
print(format(num3, '7.2f'))
print(format(num4, '7.2f'))
print(format(num5, '7.2f'))
print(format(num6, '7.2f'))